# 2. В школі вирішили набрати 3 нових математичинх класи.
# Заняття проходять в один і той самий час, тому виділили 3 різних кабінети.
# За партою може сидіти не більше 2 учнів. Відома кількість учнів в кожному з 3х класів.
# Скільки потрібно закупити парт щоб вистачило на усіх учнів?
# Програма запрошує по черзі 3 натуральних числа: кількість учнів у першому другому та третьму класах.
# Програма друкує видповідь в термінал - > кількість парт що треба закупити
# Використовувати лише арифметичні оператори( Підказка: вам знадобляться // та %)
N1 = int(input('введіть кільксіть першому класі: '))
N2 = int(input('введіть кількість другому класі: '))
N3 = int(input('введіть кількість третьому класі: '))
if N1 % 2 == 0:
    K1 = N1 / 2
else: K1 = N1 // 2 + 1
if N2 % 2 == 0:
    K2 = N2 / 2
else: K2 = N2 // 2 + 1
if N3 % 2 == 0:
    K3 = N3 / 2
else: K3 = N3 // 2 + 1
K = K1 + K2 + K3
print('кількість парт що треба закупити: ', int(K), end='\n')