# 4. У Грегоріанському календарі використовуються 3 умови виявлення високосного року.
# Рік можна без залишку розділити на 4, це високосний рік, якщо:
# Рік можна розділити порівну на 100, це не високосний рік, якщо:
# Рік також ділиться на 400 без залишку. Тоді це високосний рік.
# Це означає, що у Григоріанському календарі 2000 та 2400 роки є високосними, а 1800, 1900, 2100, 2200, 2300 та 2500 - Не Є високосними.
# Завдання: Створити програму яка просить рік для перевірки та  відповідає наступним вимогам:
# 1. Рік який введено повинен бути в диапазоні 1900 < рік < 1_000_000
# Якщо рік не в диапазоні - повідомити що рік не відповідає умовам - і закінчити роботу програми.
# 2. Якщо рік  відповідає вимогам - провести перевірку на високостний\невисокостний і повідомити в термінал. Наприклад: “1987 is not leep year”“
YEAR = int(input('введіть рік в диапазоні 1900 < рік < 1_000_000: '))
if YEAR > 1000000 or YEAR < 1900:
    print('рік не відповідає умовам')
elif YEAR % 4 == 0 and YEAR % 100 != 0 or YEAR % 400 == 0:
      print( YEAR, 'високосний')
else: print( YEAR, 'не високосний')