# 1. N школярів ділять К яблук порівну, остача залишається в корзинці.
# Скільки яблук дістанеться кожому школяру ?
# Скільки яблук залишиться в корзинці.
# Програма запрошує по черзі  числа для N та K і повинна вивести 2 значення:
# 1. Кожному школяру дісталося яблук: результат
# 2. Яблук залишилось в корзинці: остача
print('Давайте порахуємо задачу. N школярів ділять К яблук порівну, остача залишається в корзинці', end='\n')
N = int(input('введіть кількість школярів N: '))
K = int(input('введіть кількість яблук K: '))
print('Кожному школяру дісталось: ', (K//N), ' яблук', end='\n')
print('Яблук залишилось в корзинці: ', (K%N), ' яблук', end=' ')